rails/app/controllers/users_controller.rb

  def index
    @users = User.all.order(:first_name)
---
SELECT "users".* FROM "users"   ORDER BY "users"."first_name" ASC

    def find_user
      @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2 LIMIT 1